//=============================================================================
//============================= Настройки =====================================
//=============================================================================

// Число импульсов датчика скорости на 1 км
#define SPEED_SENSOR_COUNT 6000

// Управление энкодером
//#define ENCODER_CONTROL

// Включение анимации смены экрана
//#define ANIMATION_ENABLE
// Скорость анимации смена экрана (пикселей за цикл)
#define ANIMATION_SPEED 10

//=============================================================================
//============ Лимиты показаний для срабатывания сигнализации =================
//=============================================================================
// Пороги напряжения сети
#define BATT_VOLT_MIN (12 * 400)
#define BATT_VOLT_MAX (14.5 * 400)

// Пороги значений для температуры ОЖ
#define WATER_TEMP_MIN -30
#define WATER_TEMP_MAX 96

// Пороги значений для температуры воздуха
#define AIR_TEMP_MIN (-20 * 4)
#define AIR_TEMP_MAX (55 * 4)

// Порог значений наддува
#define OVERBOOST_LIMIT 176

// Порог значений для УДК
#define UDK_VOLT_MIN (0.01 * 400)
#define UDK_VOLT_MAX (0.87 * 400)

// Порог значений для ШДК
#define LAMBDA_AFR_MIN (12.0 * 128)
#define LAMBDA_AFR_MAX (15.2 * 128)

// Пороги значений для лямбда коррекции
#define LAMBDA_CORR_MIN (-15 * 512)
#define LAMBDA_CORR_MAX (15 * 512)

// Порог значений оборотов
#define RPM_LIMIT 5500

//=============================================================================
//================================== Отладка ==================================
//=============================================================================
// Режим отладки. Проверка работы экранов без подключения к SECU.
// Раскомментировать для включения.
#define DEBUG_MODE

// Запись значений пробега и расхода, если случайно затер или при замене платы.
// Расход топлива храниться в мл, потому надо умножать литры на 1000.

// Для записи в EEPROM указанных ниже значений при запуске БК держать кнопку "Влево".

// При варианте с энкодером раскомментировать строку ниже, прошить,
// закомментировать и прошить.
//#define WRITE_EEPROM_ON_START

// 30.06.2024
// Раскомментировать параметры, которые необходимо записать в EEPROM	 
#define WRITE_DISTANCE_DAY (0 * 1000LU)
#define WRITE_DISTANCE_ALL (27793 * 1000LU)
#define WRITE_FUEL_BURNED_DAY (0 * 1000LU)
#define WRITE_FUEL_BURNED_ALL (2451 * 1000LU)

//#define WRITE_ENGINE_HOURS 100.0 * 3600

#define WRITE_BRIGHT_LCD_NIGHT 0
#define WRITE_BRIGHT_LCD_DAY 255

//#define WRITE_BRIGHT_PWM_NIGHT 0
//#define WRITE_BRIGHT_PWM_DAY 255

//=============================================================================
//================================== Прочее ===================================
//=============================================================================
#define MAX_CE_BITS_COUNT 24
